.. _idnr_userguide:

IDNR Strings
============

Introduction
------------

The function :func:`clean_de_idnr() <dataprep.clean.clean_de_idnr.clean_de_idnr>` cleans a column containing German personal tax number (IDNR) strings, and standardizes them in a given format. The function :func:`validate_de_idnr() <dataprep.clean.clean_de_idnr.validate_de_idnr>` validates either a single IDNR strings, a column of IDNR strings or a DataFrame of IDNR strings, returning `True` if the value is valid, and `False` otherwise.

IDNR strings can be converted to the following formats via the `output_format` parameter:

* `compact`: only number strings without any seperators or whitespace, like "36574261809"
* `standard`: IDNR strings with proper whitespace in the proper places, like "36 574 261 809"

Invalid parsing is handled with the `errors` parameter:

* `coerce` (default): invalid parsing will be set to NaN
* `ignore`: invalid parsing will return the input
* `raise`: invalid parsing will raise an exception

The following sections demonstrate the functionality of `clean_de_idnr()` and `validate_de_idnr()`.

### An example dataset containing IDNR strings

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(
    {
        "idnr": [
            "36574261809",
            "36554266806",
            "51824753556",
            "51 824 753 556",
            "hello",
            np.nan,
            "NULL"
        ], 
        "address": [
            "123 Pine Ave.",
            "main st",
            "1234 west main heights 57033",
            "apt 1 789 s maple rd manhattan",
            "robie house, 789 north main street",
            "(staples center) 1111 S Figueroa St, Los Angeles",
            "hello",
        ]
    }
)
df

             idnr                                           address
0     36574261809                                     123 Pine Ave.
1     36554266806                                           main st
2     51824753556                      1234 west main heights 57033
3  51 824 753 556                    apt 1 789 s maple rd manhattan
4           hello                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6            NULL                                             hello

## 1. Default `clean_de_idnr`

By default, `clean_de_idnr` will clean idnr strings and output them in the standard format with proper separators.

In [2]:
from dataprep.clean import clean_de_idnr
clean_de_idnr(df, column = "idnr")

,idnr,address,idnr_clean
0,36574261809,123 Pine Ave.,36 574 261 809
1,36554266806,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 2. Output formats

This section demonstrates the output parameter.

### `standard` (default)

In [3]:
clean_de_idnr(df, column = "idnr", output_format="standard")

,idnr,address,idnr_clean
0,36574261809,123 Pine Ave.,36 574 261 809
1,36554266806,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `compact`

In [4]:
clean_de_idnr(df, column = "idnr", output_format="compact")

,idnr,address,idnr_clean
0,36574261809,123 Pine Ave.,36574261809
1,36554266806,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 3. `inplace` parameter

This deletes the given column from the returned DataFrame. 
A new column containing cleaned IDNR strings is added with a title in the format `"{original title}_clean"`.

In [5]:
clean_de_idnr(df, column="idnr", inplace=True)

       idnr_clean                                           address
0  36 574 261 809                                     123 Pine Ave.
1             NaN                                           main st
2             NaN                      1234 west main heights 57033
3             NaN                    apt 1 789 s maple rd manhattan
4             NaN                robie house, 789 north main street
5             NaN  (staples center) 1111 S Figueroa St, Los Angeles
6             NaN                                             hello

## 4. `errors` parameter

### `coerce` (default)

In [6]:
clean_de_idnr(df, "idnr", errors="coerce")

,idnr,address,idnr_clean
0,36574261809,123 Pine Ave.,36 574 261 809
1,36554266806,main st,NaN
2,51824753556,1234 west main heights 57033,NaN
3,51 824 753 556,apt 1 789 s maple rd manhattan,NaN
4,hello,"robie house, 789 north main street",NaN
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

### `ignore`

In [7]:
clean_de_idnr(df, "idnr", errors="ignore")

,idnr,address,idnr_clean
0,36574261809,123 Pine Ave.,36 574 261 809
1,36554266806,main st,36554266806
2,51824753556,1234 west main heights 57033,51824753556
3,51 824 753 556,apt 1 789 s maple rd manhattan,51 824 753 556
4,hello,"robie house, 789 north main street",hello
5,NaN,"(staples center) 1111 S Figueroa St, Los Angeles",NaN
6,NULL,hello,NaN

## 4. `validate_de_idnr()`

`validate_de_idnr()` returns `True` when the input is a valid IDNR. Otherwise it returns `False`.

The input of `validate_de_idnr()` can be a string, a Pandas DataSeries, a Dask DataSeries, a Pandas DataFrame and a dask DataFrame.

When the input is a string, a Pandas DataSeries or a Dask DataSeries, user doesn't need to specify a column name to be validated. 

When the input is a Pandas DataFrame or a dask DataFrame, user can both specify or not specify a column name to be validated. If user specify the column name, `validate_de_idnr()` only returns the validation result for the specified column. If user doesn't specify the column name, `validate_de_idnr()` returns the validation result for the whole DataFrame.

In [8]:
from dataprep.clean import validate_de_idnr
print(validate_de_idnr("36574261809"))
print(validate_de_idnr("36554266806"))
print(validate_de_idnr("51824753556"))
print(validate_de_idnr("51 824 753 556"))
print(validate_de_idnr("hello"))
print(validate_de_idnr(np.nan))
print(validate_de_idnr("NULL"))

True
False
False
False
False
False
False

### Series

In [9]:
validate_de_idnr(df["idnr"])

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: idnr, dtype: bool

### DataFrame + Specify Column

In [10]:
validate_de_idnr(df, column="idnr")

0     True
1    False
2    False
3    False
4    False
5    False
6    False
Name: idnr, dtype: bool

### Only DataFrame

In [11]:
validate_de_idnr(df)

    idnr  address
0   True    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False    False
6  False    False